Revit 2026 API

# MEPSectionVelocityPressure Property

---

The velocity pressure of the section.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double VelocityPressure { get; }
```
```vb
Public ReadOnly Property VelocityPressure As Double
	Get
```
```cpp
public:
property double VelocityPressure {
	double get ();
}
```
```fsharp
member VelocityPressure : float with get
```

#### Property Value

Double

Default unit is Kgf per square feet. For Duct, unit type is UT_HVAC_Pressure. For Pipe, unit type is UT_Piping_Pressure

#### Reference

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace